{"inkVersion":20,"root":[["ev",0,"/ev",{"VAR=":"char_left","re":true},"ev",0,"/ev",{"VAR=":"char_right","re":true},"^CONTENT WARNING: This game present instances of Online Harrasment, Stalking and Threats of Violence.","\n","^If you're not comfortable with any of these themes, please be wary about the contents of this visual novel.","\n","^Viewer discretion is advised","\n","ev",2,"/ev",{"VAR=":"char_left","re":true},"^Etsuko sits quietly on the floor of the room, lights off phone in hand.","\n","^Someone had not only been following her, but also taking photos and posting them online in a message forum from a time ago.","\n","^It wasn't long before someone found her only social media account and shared it.","\n","^She was now receiving innappropiate messages from strangers on the internet. One of the few she felt brought her comfort.","\n","^A photo of her with Hibiscus, holding hands, started making the rounds and all the, already bad unwanted attention, turned into lesbophobia.","\n","^The messages went from unsolicited gross comments from strangers to people claiming that they knew where she lived, and that they wanted to harm her.","\n","^She was already experiencing agoraphobia before this, and she was now panicking real bad.","\n","ev",{"VAR?":"nervous"},"/ev",{"VAR=":"velocidad_texto","re":true},"^Etsuko: W-What should I do...?","\n","ev","str","^Message her girlfriend","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Handle it on her own","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["^ ",{"->":"yellow1"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"blue1"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"yellow1":[["ev",{"VAR?":"normal"},"/ev",{"VAR=":"velocidad_texto","re":true},"ev",0,"/ev",{"VAR=":"char_left","re":true},"ev",2,"/ev",{"VAR=":"scenario","re":true},"ev",3,"/ev",{"VAR=":"char_right","re":true},"^The pink haired shop owner, Hibiscus, was finishing up cleaning up after work on her tea house, when her phone started to ring.","\n","^She took it out of her pockets to find a message from her girlfriend","\n","^Etsuko: Hey Hibiscus, sorry.","\n","^Etsuko: I don't think I'll be able to catch you at the end of your job today.","\n","^Hibiscus found this weird, Etsuko was too anxious to tell her that she wouldn't go so late in the day, so she inmediately thought it could be something urgent, and that she could be downplaying it.","\n","^She messaged her back.","\n","^Hibiscus: Is everything okay?","\n","ev",0,"/ev",{"VAR=":"char_right","re":true},"^...","\n","ev",1,"/ev",{"VAR=":"scenario","re":true},"ev",2,"/ev",{"VAR=":"char_left","re":true},"^Etsuko recieved a message back from Hibiscus, her notifications on her social media app were exploding in the background.","\n",["ev",{"^->":"yellow1.0.46.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^I am kinda having a situation... ",{"->":"$r","var":true},null]}],["ev",{"^->":"yellow1.0.47.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^It's nothing. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"yellow1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.46.s"},[{"#n":"$r2"}],{"->":"orange1"},"\n",{"#f":5}],"c-1":["ev",{"^->":"yellow1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.47.s"},[{"#n":"$r2"}],{"->":"green1"},"\n","end",{"#f":5}]}],{"#f":1}],"blue1":["ev",{"VAR?":"normal"},"/ev",{"VAR=":"velocidad_texto","re":true},"ev",1,"/ev",{"VAR=":"scenario","re":true},"ev",2,"/ev",{"VAR=":"char_left","re":true},"^Etsuko decided to manage the situation on her own.","\n","ev",0,"/ev",{"VAR=":"char_left","re":true},"^Still sitting on the floor in the dark, she went into her DM requests, that sat on +99.","\n","^Some went on about her looks, some were gross comments or unsolizcited nudes.","\n","^She picked one at random, she decided to skip the message when she noticed a lesbophobic slur on it.","\n","^\"Why are you doing this?\" she wrote back.","\n","^Then she went into the messages of the next, this time she didn't skip the mssage, but she wish she did afterwards.","\n","^\"Is this funny to you?\", she wrote, feeling mad.","\n","^She went into another one.","\n","^...","\n","^She wasn't feeling well.","\n","^Etsuko spent hours on the unlight floor of her room answering messages from her harassers.","\n","^BAD END","\n","end",{"#f":1}],"orange1":["^Etsuko explained to her girlfriend what was going on.","\n","^Etsuko: There's someone taking photos of me...","\n","^Etsuko: They're putting them up on this message board site, and it attracted a lot of people, and nasty comments.","\n","^Hibiscus: w-what?","\n","^Etsuko: Apparently it has been going on for a while, but I just started getting lots of messages...","\n","^Hibiscus: I'm going over right now, don't hang up.","\n","ev",2,"/ev",{"VAR=":"scenario","re":true},"ev",0,"/ev",{"VAR=":"char_left","re":true},"ev",0,"/ev",{"VAR=":"char_right","re":true},"^Hibiscus grabbed her keys, her jacket and closed the shop as it was.","\n","^She was holding her phone in her shoulder as she made her way to Etsuko's apartment and Etsuko told her what she knew.","\n","ev",1,"/ev",{"VAR=":"scenario","re":true},"ev",3,"/ev",{"VAR=":"char_right","re":true},"^Hibiscus made it to Etsuko's apartment and told her she was entering over the phone as she used her copy of the keys.","\n","^She found Etsuko in her room sitting on the floor in the dark.","\n","ev",1,"/ev",{"VAR=":"char_left","re":true},"^Hibiscus: Etsuko!","\n","^Etsuko: H-Hibiscus...","\n",{"->":"yellow2"},"end",{"#f":1}],"green1":["^Etsuko sent the message back, then silenced her phone, and curled up agaisnt herself.","\n","^She was getting too many gross messages, and too much hate for her to handle.","\n","ev",0,"/ev",{"VAR=":"char_left","re":true},"^...","\n","ev",2,"/ev",{"VAR=":"scenario","re":true},"ev",3,"/ev",{"VAR=":"char_right","re":true},"^Hibiscus waited a few seconds and got an answer back.","\n","^Etsuko: \"It's nothing.\"","\n","^Hibiscus read her girlfriend's answer a first time, then a second. She thought it was 'out of character', and worried.","\n","^She sent a last message to her girlfriend.","\n","^Hibiscus: I'm coming over.","\n","^Hibiscus rushed to finish up her chores in her store and headed for Etsuko's apartment.","\n","^...","\n","^Etsuko still sat on the floor of her dark room, unable to think what to do.","\n","^Etsuko: Are these people serious?","\n","^Etsuko: There's a big chance that... they're just saying stuff like that to scare me...","\n","^Etsuko knew she suffered from paranoid thoughts because of her anxiety, so she didn't want to rush to the conclusion that this was, in fact, an actual risk.","\n","^While she thought about how real was the danger she could be in, she felt the knob of her door start to move.","\n","^Etsuko panicked, as she thought someone who claimed to know where she lived did actually know and was trying to break in.","\n","ev",2,"/ev",{"VAR=":"char_left","re":true},"^Etsuko: It's okay, it's not like they can actually break in, right?","\n","ev",0,"/ev",{"VAR=":"char_left","re":true},"^The door opened.","\n","^Etsuko froze up.","\n","^Hibiscus entered the room and turned on the lights, Etsuko jumped from the impression, but relaxed as soon as she noticed who she was looking at.","\n","ev",2,"/ev",{"VAR=":"char_left","re":true},"^Etsuko: Hibiscus! You're... here?","\n","^Hibiscus: Etsuko! What happened?","\n","^Etsuko: I... I don't know how to explain it.","\n","^Hibiscus: You could start with why you're not answering your phone, I tried calling you so much before just using the keys you gave me.","\n","^Etsuko: Oh... I'm sorry... And I appreciate you trying to not scare me.","\n","^Etsuko: ...","\n","^Etsuko looked down to the floor, unable to get the words out.","\n","^Etsuko: The thing is...","\n","^Etsuko took in a deep breath, in which she tohught she might begin crying in any moment.","\n","^Etsuko: T-There... There are guys taking photos of me, and putting them on some site...","\n","ev",4,"/ev",{"VAR=":"char_right","re":true},"^Hibiscus: ... What?!","\n","^Etsuko: And someone found my social and put it next to it...","\n","^Etsuko: I've been receiving a lot of agressive... and gross messages...","\n","^Etsuko began crying between her words.","\n","^Etsuko: And some of them even have said they want to harm me, and that they know where I live...","\n","^Hibiscus: WHAT?!","\n","^Etsuko: T-There's photos of both of us there, and it prompted so much hate...","\n","^Etsuko was now fully crying","\n","^Hibiscus: Homophobic pieces of shit.","\n",{"->":"yellow2"},"end",{"#f":1}],"yellow2":["ev",0,"/ev",{"VAR=":"char_right","re":true},"^Hibiscus gave Etsuko a long hug, she felt her girlfriend tearing up and shaking. She felt horrible Etsuko had to go through something like this.","\n","^She went into Etsuko's closet, taking out her travel bag and start filling it with her clothes.","\n","^Hibiscus: You're staying over with me.","\n","^Etsuko: Uh...?","\n","^Hibiscus: You're not safe.","\n","^Etsuko: I... I don't...","\n","^Hibiscus: You're not safe. We're reporting this to the police, and you'll be with me until we know you're safe.","\n","^Hibiscus: Go get your laptop and your phone.","\n","^Etsuko noded, and swept some tears away, as she stood up to store her stuff.","\n","^Once they both finished putting Etsuko's stuff away, they both left.","\n","ev",{"CNT?":"orange1"},"out","/ev","^ ",{"->":"orange2"},"\n","ev",{"CNT?":"orange1"},"!","out","/ev","^ ",{"->":"green2"},"\n","end",{"#f":1}],"green2":["ev",3,"/ev",{"VAR=":"scenario","re":true},"ev",0,"/ev",{"VAR=":"char_left","re":true},"ev",0,"/ev",{"VAR=":"char_right","re":true},"^Once they were in Hibiscus' place, and Etsuko had a moment to breathe, Hibiscus asked for Etsuko's phone.","\n","^Hibiscus: Let me have a look into your inbox.","\n","^Etsuko unlocked her phone and gave it to Hibiscus, who opened up her social media app and went into the Message Requests tab.","\n","^Almost all messages were disgusting, and it wasn't long before she felt too disgusted to continue reading just the first words of each of them.","\n","^She took screenshots of the messages for evidence, while trying to consciously not read them, and deleted the app.","\n","^Hibiscus: You don't need to keep seeing this right now.","\n","^Etsuko nodded.","\n","^Hibiscus: Where are the photos?","\n","^Etsuko took her phone, opened her web browser and gave it back to Hibiscus.","\n","^There were post with photos of Etsuko outside near her house, and one of them both holding hands walking around.","\n","^There were also lots of text posts with really gross comments.","\n","^She took screenshots of what she found and then she called the cops while she left Etsuko to finally sleep in her lap.","\n","^...","\n","^Hibiscus hung up. She had filed a report for online harrasment and threats of violence.","\n","^Etsuko was sleeping soundly.","\n","^The poor girl had been going through some really bad anxiety since she realized what was going on.","\n","^Being somewhere else with Hibiscus, gave her the first chance to put down her defenses for a long while.","\n","^Hibiscus carried Etsuko to her bed and left her to sleep, then walked over to her living room to work on something","\n","^...","\n",{"->":"yellow3"},{"#f":1}],"orange2":["ev",3,"/ev",{"VAR=":"scenario","re":true},"^Once they were in Hibiscus' place, Hibiscus had convinced Etsuko that she should make a police report.","\n","^They both took screenshots of everything on the message board page and the DM's she had gotten.","\n","^Etsuko, after a minute of breathing and preparing, called the police and connected with someone that recieved her evidence.","\n",{"->":"yellow3"},{"#f":1}],"yellow3":["ev",3,"/ev",{"VAR=":"scenario","re":true},"^Etsuko woke up, it was morning already and she found herself sleeping on Hibiscus bed.","\n","^For just a moment, she had forgotten what happened the previous day.","\n","^She quickly jumped up, and looked around for Hibiscus, who she found sleeping on top of her laptop.","\n","^On her screen there was a 404 error.","\n","ev",1,"/ev",{"VAR=":"char_left","re":true},"^Etsuko: H-Hibiscus?","\n","^Hibiscus slowly woke up, and saw Etsuko.","\n","ev",3,"/ev",{"VAR=":"char_right","re":true},"^Hibiscus: Oh... Hey Etsuko...","\n","^Hibiscus stretched and gave a look to her laptop's screen.","\n","^After noticing what was on it, she went through a few tabs and after comfirming it, she raised her hands and gave Etsuko a tired","\n","^Hibiscus: yaaaayyy~","\n","^Etsuko: W-What happened?","\n","^Hibiscus: After talking to the police, I looked onto having your photos taken down.","\n","^Hibiscus: I talked to their service provider and I think they had their service cut for not following their terms of service by harrasing people with it.","\n","^Etsuko: O-Oh! That's great!","\n","^Hibiscus noticed Etsuko tearing up.","\n","^Hibiscus: I don't know what to do about what you've gotten into your social apart from blocking and reporting, but you should be left alone sooner than later...","\n","^Etsuko: W-Will everything be alright?","\n","^Hibiscus: You're staying with me longer, at least until the police catch the creep who took the photos.","\n","^Etsuko: Is that okay?","\n","^Hibiscus: Obviously it's okay. You're not gonna rest one bit at your apartment. Aren't you?","\n","^Etsuko: M-Maybe...","\n","^Hibiscus hugged Etsuko and they spent a moment appreciating the silence.","\n","^Hibiscus: Etsuko... I'm really sorry you had to go through this...I'm sorry you're still going through this...","\n","^Etsuko: ...","\n","^Hibiscus: It's really messed up, no one should have to go through this.","\n","^Hibiscus: Your anxiety must have been killing you.","\n","^Etsuko let her tears go out .","\n","^Hibiscus: You can stay for however long you like, Etsuko.","\n","^Etsuko: T-Thank you...","\n","ev",0,"/ev",{"VAR=":"char_left","re":true},"ev",0,"/ev",{"VAR=":"char_right","re":true},"ev",0,"/ev",{"VAR=":"scenario","re":true},"^...","\n","ev",3,"/ev",{"VAR=":"scenario","re":true},"^A few months had gone by, but then Etsuko and Hibiscus finally got word that the person who was taking the photos was caught.","\n","^They had found the originals in the camera's memory and even all the places it was posted so it could be taken down.","\n","^Etsuko finally could rest a bit better, thinking most of the presence of those photos were deleted.","\n","^But she also knew that a lot of people had saved them.","\n","^Etsuko went back into her social media account for the first time in months, and she found most of her notifs weren't recent.","\n","^Just deleting the first page she had found had minimized most of the damage.","\n","^She then went to write a post, where she talked about the experience she had to go through, and how you don't have to handle it alone.","\n","^...","\n","^After some months more, Etsuko decided to move in with Hibiscus permanently, and sell her old apartment.","\n","^She didn't feel safe anymore in that area knowing what had happened and knowing more people claimed to know where she lived.","\n","^But she finally felt at peace.","\n","^GOOD END","\n","end",{"#f":1}],"global decl":["ev",1.0,{"VAR=":"velocidad_texto"},1.0,{"VAR=":"normal"},0.7,{"VAR=":"nervous"},3.0,{"VAR=":"surprised"},1,{"VAR=":"scenario"},0,{"VAR=":"char_left"},0,{"VAR=":"char_right"},"/ev","end",null],"#f":1}],"listDefs":{}}